<script setup>
import { ref } from "vue";

const isVisiblePolicy = ref(false);

function showWindowPolicy() {
  isVisiblePolicy.value = true;
}
function hideWindowPolicy() {
  isVisiblePolicy.value = false;
}

const isVisibleConditions = ref(false);

function showWindowConditions() {
  isVisibleConditions.value = true;
}
function hideWindowConditions() {
  isVisibleConditions.value = false;
}

const isVisibleAgreement = ref(false);

function showWindowArgeement() {
  isVisibleAgreement.value = true;
}
function hideWindowArgeement() {
  isVisibleAgreement.value = false;
}
</script>

<template>
  <div class="footers">
    <div class="footer">
      <div class="footer__inner">
        <div class="contacts_n_agreement">
          <div class="contacts">
            <div class="main-text">
              <h3>Контакты</h3>
            </div>
            <div class="infos">
              <div>
                <h5>Адрес</h5>
                <p>Казахстан, Алматы, Улица Сатпаева 90а</p>
              </div>
              <div>
                <h5>Тех поддержка</h5>
                <p>+(775) 127 9898</p>
              </div>
              <div>
                <h5>Отдел продажа</h5>
                <p>+(775) 127 9898</p>
              </div>
              <div>
                <h5>Почта</h5>
                <p>info@simpra.kz</p>
              </div>
            </div>
          </div>
          <div class="agreement">
            <div class="main-text">
              <h3>Договор</h3>
            </div>
            <div class="infos2">
              <h5 @click="showWindowPolicy">Политика конфиденциальности</h5>
              <h5 @click="showWindowConditions">Условия доставки и возврата</h5>
              <h5 @click="showWindowArgeement">
                Договор дистанционной продажи
              </h5>

              <div class="overlay" v-if="isVisiblePolicy">
                <h1 @click="hideWindowPolicy">X</h1>
                <div class="modal">
                  <p>
                    Правила защиты информации о пользователях сервиса Simpra
                    <br />
                    1. Общие положения <br />1.1. Настоящие Правила являются
                    официальным документом ИП «Simpra» (далее – Компания) и
                    определяют порядок обработки и защиты информации о
                    физических лицах, пользующихся услугами сервиса Simpra
                    (далее – Сервис), доступного по адресу www.simpra.kz и в
                    мобильных приложениях Simpra (далее – Пользователи).<br />
                    1.2. Целью настоящих Правил является обеспечение надлежащей
                    защиты информации о пользователях, в том числе их
                    персональных данных, от несанкционированного доступа и
                    разглашения. <br />1.3. Отношения, связанные со сбором,
                    хранением, распространением и защитой информации о
                    пользователях Сервиса, регулируются настоящими Правилами,
                    иными официальными документами Компании и действующим
                    законодательством РК.<br />
                    1.4. Действующая редакция Правил, являющихся публичным
                    документом, доступна любому пользователю сети Интернет при
                    переходе по ссылке https://simpra.kz/privacy-policy/kz.
                    Компания вправе вносить изменения в настоящие Правила. При
                    внесении изменений в Правила Компания уведомляет об этом
                    Пользователей путем размещения новой редакции Правил по
                    постоянному адресу https://simpra.kz/privacy-policy/kz не
                    позднее, чем за 10 дней до вступления в силу соответствующих
                    изменений. Предыдущие редакции Правил хранятся в архиве
                    документации Компании. <br />1.5. Настоящие Правила
                    разработаны и используются в соответствии с Пользовательским
                    соглашением сервиса Simpra, размещенным по адресу
                    http://simpra/agreement/kz. В случае наличия противоречий
                    между настоящими Правилами и иными официальными документами
                    Компании применению подлежат настоящие Правила. <br />1.6.
                    Регистрируясь и используя Сервис, Пользователь выражает свое
                    согласие с условиями настоящих Правил.<br />
                    1.7. В случае несогласия Пользователя с условиями настоящих
                    Правил использование Сервиса должно быть немедленно
                    прекращено.<br />
                    2. Условия пользования Сервисом<br />
                    2.1. Оказывая услуги по использованию Сервиса, Компания,
                    действуя разумно и добросовестно, считает, что Пользователь:
                    обладает всеми необходимыми правами, позволяющими ему
                    осуществлять регистрацию и использовать Сервис; указывает
                    достоверную информацию о себе в объемах, необходимых для
                    пользования Сервисом; осознает, что информация, размещаемая
                    Пользователем о себе, может становиться доступной для других
                    Пользователей Сервиса и пользователей Интернета, может быть
                    скопирована и распространена такими пользователями;
                    осознает, что некоторые виды информации, переданные им
                    другим Пользователям, не могут быть удалены самим
                    Пользователем; ознакомлен с настоящими Правилами, выражает
                    свое согласие с ними и принимает на себя указанные в них
                    права и обязанности. <br />2.2. Компания не проверяет
                    достоверность получаемой (собираемой) информации о
                    пользователях, за исключением случаев, когда такая проверка
                    необходима в целях исполнения Компанией обязательств перед
                    пользователем.<br />
                    3. Цели обработки информации <br />3.1. Компания
                    осуществляет обработку информации о Пользователях, в том
                    числе их персональных данных, в целях выполнения
                    обязательств Компанией перед Пользователями в отношении
                    использования Сервиса.<br />
                    4. Состав информации о пользователях <br />
                    4.1. Персональные данные Пользователей включают в себя:
                    <br />4.1.1. предоставляемые Пользователями при создании
                    визитных карточек в Сервисе: имя, фамилия, отчество, номера
                    мобильного, домашнего и рабочего телефонов, адрес
                    электронной почты, дата рождения, домашний адрес, ссылки на
                    профили в социальных сетях, место работы и должность.<br />
                    4.1.2. дополнительно предоставляемые Пользователями по
                    запросу Компании в целях исполнения Компанией обязательств
                    перед Пользователями, вытекающих из договора на оказание
                    услуг Сервиса. Компания вправе, в частности, запросить у
                    Пользователя копию документа, удостоверяющего личность, либо
                    иного документа, содержащего имя, фамилию, фотографию
                    Пользователя, а также иную дополнительную информацию,
                    которая, по усмотрению Компании, будет являться необходимой
                    и достаточной для идентификации такого Пользователя и
                    позволит исключить злоупотребления и нарушения прав третьих
                    лиц. <br />4.2. Компания может также обрабатывать иную
                    информацию о Пользователях, которая включает в себя:
                    <br />4.2.1. дополнительные данные, получаемые при доступе к
                    Сервису, включающие в себя данные о технических средствах
                    (устройствах), технологическом взаимодействии с Сервисом (в
                    т.ч. IP-адрес хоста, вид операционной системы пользователя,
                    тип браузера, географическое положение, поставщик услуг
                    Интернета, данные из адресной книги, данные, полученные в
                    результате доступа к камере, микрофону и т.п. устройств), и
                    последующих действиях Пользователя в Сервисе.<br />
                    4.2.2. информация, автоматически получаемая при доступе к
                    Сервису с использованием закладок (cookies). <br />5.
                    Обработка информации о пользователях<br />
                    5.1. Обработка персональных данных осуществляется на основе
                    принципов: <br />а) законности целей и способов обработки
                    персональных данных; <br />б) добросовестности; <br />
                    в) соответствия целей обработки персональных данных целям,
                    заранее определенным и заявленным при сборе персональных
                    данных, а также полномочиям Компании;<br />
                    г) соответствия объема и характера обрабатываемых
                    персональных данных, способов обработки персональных данных
                    целям обработки персональных данных; <br />д) недопустимости
                    объединения созданных для несовместимых между собой целей
                    баз данных, содержащих персональные данные.<br />
                    5.1.1. Условия и цели обработки персональных данных Компания
                    осуществляет обработку персональных данных пользователя в
                    целях исполнения договора между Компанией и Пользователем на
                    оказание услуг Сервиса (п. 8.1 Пользовательского соглашения
                    сервиса Simpra).<br />
                    5.1.2. Сбор персональных данных Сбор персональных данных
                    Пользователя осуществляется при создании и редактировании
                    визитных карточек Пользователя в Сервисе.<br />
                    5.1.3. Хранение и использование персональных данных
                    Персональные данные пользователей хранятся исключительно на
                    электронных носителях и обрабатываются с использованием
                    автоматизированных систем, за исключением случаев, когда
                    неавтоматизированная обработка персональных данных
                    необходима в связи с исполнением требований
                    законодательства. <br />5.1.4. Передача персональных данных
                    Персональные данные Пользователей не передаются каким-либо
                    третьим лицам, за исключением случаев, прямо предусмотренных
                    настоящими Правилами. При указании пользователя или при
                    наличии согласия пользователя возможна передача персональных
                    данных пользователя третьим лицам-контрагентам Компании с
                    условием принятия такими контрагентами обязательств по
                    обеспечению конфиденциальности полученной информации.
                    Предоставление персональных данных Пользователей по запросу
                    государственных органов (органов местного самоуправления)
                    осуществляется в порядке, предусмотренном законодательством.
                    <br />5.1.5. Уничтожение персональных данных Персональные
                    данные пользователя уничтожаются при: – самостоятельном
                    удалении Пользователем данных из своих визитных карточек; –
                    удалении Компанией информации, размещаемой Пользователем, в
                    случаях, установленных Пользовательским соглашением сервиса
                    Simpra (п.п. 2.8 и 3.2). <br />5.2. Размещая информацию в
                    своих визитных карточках, в том числе свои персональные
                    данные, Пользователь осознает и соглашается с тем, что
                    указанная информация может быть доступна другим
                    пользователям сети Интернет. 6. Права и обязанности
                    пользователей <br />6.1. Пользователи вправе:<br />
                    6.1.1. осуществлять доступ к информации о себе посредством
                    мобильных приложений Simpra; <br />6.1.2. самостоятельно
                    вносить изменения и исправления в информацию о себе в
                    визитных карточках в Системе, при условии, что такие
                    изменения и исправления содержат актуальную и достоверную
                    информацию;<br />
                    6.1.3. удалять информацию о себе из визитных карточек в
                    Системе; <br />6.1.4. требовать от Компании уточнения своих
                    персональных данных, их блокирования или уничтожения в
                    случае, если такие данные являются неполными, устаревшими,
                    недостоверными, незаконно полученными или не являются
                    необходимыми для заявленной цели обработки и если невозможно
                    самостоятельно выполнить действия, предусмотренные п.п.
                    <br />6.1.2. и <br />6.1.3. настоящих Правил; <br />6.1.5.
                    на основании запроса получать от Компании информацию,
                    касающуюся обработки его персональных данных. <br />7. Меры
                    по защите информации о Пользователях <br />7.1. Компания
                    принимает технические и организационно-правовые меры в целях
                    обеспечения защиты персональных данных Пользователя от
                    неправомерного или случайного доступа к ним, уничтожения,
                    изменения, блокирования, копирования, распространения, а
                    также от иных неправомерных действий.<br />
                    8. Ограничение действия Правил <br />8.1. Действие настоящих
                    Правил не распространяется на действия и интернет-ресурсы
                    третьих лиц. <br />8.2. Компания не несет ответственности за
                    действия третьих лиц, получивших в результате использования
                    Интернета или Сервиса доступ к информации о Пользователе,
                    которую он разместил в своих визитных карточках, за
                    последствия использования информации, которая, в силу
                    природы Сервиса, доступна любому пользователю сети Интернет.
                    Компания рекомендует Пользователям ответственно подходить к
                    решению вопроса об объеме информации о себе, размещаемой в
                    Сервисе. <br />
                    9. Обращения пользователей <br />9.1. Пользователи вправе
                    направлять Компании свои запросы, в том числе запросы
                    относительно использования их персональных данных,
                    предусмотренные п. <br />6.1.5 настоящих Правил, в
                    письменной форме по адресу: Казахстан, Алматы, Улица
                    Сатпаева 90а, офис 208 или в форме электронного документа,
                    подписанного квалифицированной электронной подписью в
                    соответствии с законодательством РK, по адресу электронной
                    почты: info@simpra.kz. <br />9.2. Запрос, направляемый
                    пользователем, должен содержать следующую информацию: номер
                    основного документа, удостоверяющего личность пользователя
                    или его представителя; сведения о дате выдачи указанного
                    документа и выдавшем его органе; сведения, подтверждающие
                    участие пользователя в отношениях с оператором (в частности,
                    адрес электронной почты, использовавшийся для регистрации в
                    Системе); подпись пользователя или его представителя.
                    <br />9.3. Компания обязуется рассмотреть и направить ответ
                    на поступивший запрос пользователя в течение 30 дней с
                    момента поступления обращения.<br />
                    9.4. Вся корреспонденция, полученная Компанией от
                    пользователей (обращения в письменной или электронной
                    форме), относится к информации ограниченного доступа и не
                    разглашается без письменного согласия Пользователя.
                    Персональные данные и иная информация о Пользователе,
                    направившем запрос, не могут быть без специального согласия
                    Пользователя использованы иначе, как для ответа по теме
                    полученного запроса или в случаях, прямо предусмотренных
                    законодательством.
                  </p>
                </div>
              </div>

              <div class="overlay" v-if="isVisibleConditions">
                <h1 @click="hideWindowConditions">X</h1>
                <div class="modal">
                  <p>
                    ВАРИАНТЫ ДОСТАВКИ <br />Самовывоз(Сатпаева 90а) — БЕСПЛАТНО
                    <br />Почта по РК — БЕСПЛАТНО (от 3 дней) <br />Курьерская
                    доставка «до двери» по Казахстану — 2000 тенге (от 3 дней)
                    <br />Доставка по миру — по запросу (от 5 дней)
                    <br />ПРЕДУПРЕЖДЕНИЕ! <br />Персонализированные товары не
                    подлежат возврату или обмену.
                  </p>
                </div>
              </div>

              <div class="overlay" v-if="isVisibleAgreement">
                <h1 @click="hideWindowArgeement">X</h1>
                <div class="modal">
                  <p>
                    1. Общие положения<br />
                    1.1. ИП «Simpra» (далее — Компания) предлагает пользователю
                    сети Интернет (далее — Пользователь) использовать свой
                    сервис Simpra, доступный по адресу www.simpra.kz и в
                    мобильных приложениях Simpra (далее — Сервис), на условиях,
                    изложенных в настоящем Пользовательском соглашении (далее —
                    Соглашение). Соглашение вступает в силу с момента выражения
                    Пользователем согласия с его условиями в порядке,
                    предусмотренном п. <br />1.2 Соглашения. <br />
                    1.2. Подтвердив адрес электронной почты для использования в
                    Сервисе и/или начиная использовать Сервис (с момента
                    установки мобильного приложения), Пользователь считается
                    принявшим условия Соглашения в полном объеме, без всяких
                    оговорок и исключений. В случае несогласия Пользователя с
                    какими-либо из положений Соглашения, Пользователь не вправе
                    использовать Сервис. В случае если Компанией были внесены
                    какие-либо изменения в Соглашение в порядке, предусмотренном
                    пунктом <br />1.3 Соглашения, с которыми Пользователь не
                    согласен, он обязан прекратить использование Сервиса.
                    <br />1.3. Настоящее Соглашение может быть изменено
                    Компанией без какого-либо специального уведомления, новая
                    редакция Соглашения вступает в силу с момента ее размещения
                    в сети Интернет по указанному в настоящем пункте адресу,
                    если иное не предусмотрено новой редакцией Соглашения.
                    Действующая редакция Соглашения всегда находится на странице
                    по адресу: https://simpra/agreement/kz. Пользователь обязан
                    самостоятельно и регулярно проверять наличие изменений в
                    настоящем Соглашении. <br />1.4. Сервис предлагает
                    Пользователю возможность создания электронных визитных
                    карточек. Все существующие на данный момент функции Сервиса,
                    а также любое развитие их и/или добавление новых является
                    предметом настоящего Соглашения.<br />
                    2. Учетная запись Пользователя <br />2.1. Для того, чтобы
                    воспользоваться Сервисом, Пользователю необходимо пройти
                    процедуру подтверждения адреса электронной почты, в
                    результате которой для Пользователя будет создана уникальная
                    учетная запись. <br />2.2. Пользователь самостоятельно несет
                    ответственность за все действия (а также их последствия) в
                    рамках или с использованием Сервиса под учетной записью
                    Пользователя, включая случаи добровольной передачи
                    Пользователем данных для доступа к учетной записи
                    Пользователя третьим лицам. При этом все действия в рамках
                    или с использованием Сервиса под учетной записью
                    Пользователя считаются произведенными самим Пользователем,
                    за исключением случаев, когда Пользователь в порядке,
                    предусмотренном п. <br />2.3 настоящего Соглашения, уведомил
                    Компанию о несанкционированном доступе к Сервису с
                    использованием учетной записи Пользователя. <br />2.3.
                    Пользователь обязан немедленно уведомить Компанию о любом
                    случае несанкционированного (не разрешенного Пользователем)
                    доступа к Сервису с использованием учетной записи
                    Пользователя. Компания не отвечает за возможную потерю или
                    порчу данных, а также другие последствия любого характера,
                    которые могут произойти из-за нарушения Пользователем
                    положений этой части Соглашения.<br />2.7. Используя свою
                    учетную запись, Пользователь не вправе воспроизводить,
                    повторять и копировать какие-либо части Сервиса или доступ к
                    ним, кроме тех случаев, когда Пользователь получил такое
                    разрешение от Компании. <br />2.8. Компания вправе
                    заблокировать или удалить учетную запись Пользователя, а
                    также запретить доступ с использованием какой-либо учетной
                    записи к Сервису, и удалить любой контент без объяснения
                    причин, в том числе в случае нарушения Пользователем условий
                    Соглашения. <br />3. Контент Пользователя <br />3.1.
                    Пользователь самостоятельно несет ответственность за
                    соответствие содержания размещаемого Пользователем контента
                    требованиям действующего законодательства, включая
                    ответственность перед третьим лицами в случаях, когда
                    размещение Пользователем того или иного контента или
                    содержание контента нарушает права и законные интересы
                    третьих лиц, в том числе личные неимущественные права
                    авторов, иные интеллектуальные права третьих лиц, и/или
                    посягает на принадлежащие им нематериальные блага.
                    <br />3.2. Пользователь признает и соглашается с тем, что
                    Компания не обязана просматривать контент любого вида,
                    размещаемый и/или распространяемый Пользователем посредством
                    Сервиса, а также то, что Компания имеет право (но не
                    обязанность) по своему усмотрению отказать Пользователю в
                    размещении и/или распространении им контента или удалить
                    любой контент, который доступен посредством Сервиса.
                    Пользователь осознает и согласен с тем, что он должен
                    самостоятельно оценивать все риски, связанные с
                    использованием контента, включая оценку надежности, полноты
                    или полезности этого контента. <br />3.3. Пользователь
                    осознает и соглашается с тем, что технология работы Сервиса
                    может потребовать копирование (воспроизведение) контента
                    Пользователя Компанией, а также переработки его Компанией
                    для соответствия техническим требованиям Сервиса.<br />
                    4. Условия использования Сервиса <br />4.1. Сервис
                    предоставляет Пользователю возможность создания электронных
                    визитных карточек с возможностью передачи их путем
                    демонстрации QR-кода.<br />
                    4.2. На Сервисе запрещается совершение действий,
                    направленных на введение других пользователей в заблуждение,
                    в том числе запрещено:<br />
                    4.2.1. используя доступ к Сервису, выдавать себя за другое
                    лицо; <br />4.2.2. размещать информацию в полях форм,
                    которые не предназначены для данного типа информации;<br />
                    4.2.3. загружать, посылать, передавать или любым другим
                    способом размещать и/или распространять контент при
                    отсутствии прав на такие действия согласно законодательству
                    или каким-либо договорным отношениям;<br />
                    4.2.4. нарушать нормальную работу веб-сайта и Сервиса
                    Компании; <br />4.2.5. размещать ссылки на ресурсы сети,
                    содержание которых противоречит действующему
                    законодательству РK.<br />
                    4.3. Пользователь самостоятельно несет ответственность перед
                    третьими лицами за свои действия, связанные с использованием
                    Сервиса, в том числе, если такие действия приведут к
                    нарушению прав и законных интересов третьих лиц, а также за
                    соблюдение законодательства при использовании Сервиса.<br />
                    4.4. Пользователь соглашается с тем, что размещаемая им на
                    Сервисе информация может быть доступна для других
                    пользователей.<br />
                    4.5. Пользователь самостоятельно обеспечивает наличие
                    оборудования, соответствующего техническим требованиям для
                    использования Сервиса и доступа к сети Интернет. <br />5.
                    Исключительные права на содержание Сервиса и контент
                    <br />5.1. Все объекты, доступные при помощи Сервиса, в том
                    числе элементы дизайна, текст, графические изображения и
                    другие объекты (далее — содержание Сервиса), а также любой
                    контент, размещенный на Сервисе, являются объектами
                    исключительных прав Компании, Пользователей и других
                    правообладателей.<br />
                    5.2. Использование контента, а также каких-либо иных
                    элементов Сервиса возможно только в рамках функционала,
                    предлагаемого Сервисом. Никакие элементы содержания Сервиса,
                    а также любой контент, размещенный на Сервисе, не могут быть
                    использованы иным образом без предварительного разрешения
                    правообладателя. Под использованием подразумеваются, в том
                    числе: воспроизведение, копирование, переработка,
                    распространение на любой основе и т. д.<br />
                    6. Отсутствие гарантий, ограничение ответственности
                    <br />6.1. Сервис предоставляется «как есть». Компания не
                    принимает на себя никакой ответственности, в том числе за
                    соответствие Сервиса целям Пользователя. <br />6.2. Если при
                    использовании Сервиса будут обнаружены ошибки, Компания
                    предпримет меры для их исправления в максимально короткие
                    сроки. <br />6.3. Компания не инициирует и не контролирует
                    размещение Пользователем любой информации в процессе
                    использования Сервиса, не влияет на ее содержание и
                    целостность, а также в момент размещения указанной
                    информации не знает и не может знать нарушает ли она
                    охраняемые законом права и интересы третьих лиц,
                    международные договоры и действующее законодательство РK.
                    <br />
                    6.4. За нарушение условий настоящего Соглашения наступает
                    ответственность, предусмотренная законодательством РK.<br />
                    6.5. Компания не несет ответственности перед Пользователем
                    за любой ущерб, любую потерю доходов, прибыли, информации
                    или сбережений, связанных с использованием или с
                    невозможностью использования Сервиса, в том числе в случае
                    предварительного уведомления со стороны Пользователя о
                    возможности такого ущерба, или по любому иску третьей
                    стороны.<br />
                    6.6. Компания вправе заблокировать бесплатное использование
                    Сервиса, предоставленное посредством скачивания бесплатного
                    мобильного приложения в сети Интернет, в случае если такое
                    использование осуществляется Пользователем не в личных, а в
                    коммерческих целях организаций, кроме случаев использования
                    бесплатного Сервиса совместно с приобретенными у Компании
                    дополнительными смарт-аксессуарами (NFC/QR-карты/наклейки и
                    т. п.). <br />7. Условие обработки и использования
                    персональных данных Принимая условия настоящего Соглашения,
                    Пользователь выражает свое согласие на:<br />
                    7.1. Предоставление своих персональных данных, включающих
                    фамилию, имя, отчество, адреса электронной почты, номера
                    контактных телефонов, дату рождения, домашний адрес,
                    информацию об организации, должность для их обработки
                    Компанией, свободно, своей волей и в своем интересе. Цель
                    обработки персональных данных: — Предоставление Пользователю
                    права использования Сервиса; — Направление уведомлений,
                    касающихся использование Сервиса; — Перечень действий с
                    персональными данными, на которые Пользователь выражает свое
                    согласие: сбор, систематизация, накопление, хранение,
                    уточнение (обновление, изменение), использование,
                    обезличивание, передача третьим лицам для указанных выше
                    целей, а так же осуществление любых иных действий,
                    предусмотренных действующим законодательством РK как
                    неавтоматизированными, так и автоматизированными способами.
                    Компания обязуется принимать все необходимые меры для защиты
                    персональных данных Пользователя от неправомерного доступа
                    или раскрытия. Настоящее согласие действует до момента его
                    отзыва Пользователем путем направления соответствующего
                    уведомления на электронный адрес info@simpra.kz. <br />8.
                    Иные положения <br />8.1. Настоящее Соглашение представляет
                    собой договор между Пользователем и Компанией относительно
                    порядка использования Сервиса. <br />8.2. Настоящее
                    Соглашение регулируется и толкуется в соответствии с
                    законодательством РK. Вопросы, не урегулированные настоящим
                    Соглашением, подлежат разрешению в соответствии с
                    законодательством РK. Все возможные споры, вытекающие из
                    отношений, регулируемых настоящим Соглашением, разрешаются в
                    порядке, установленном действующим законодательством РK.
                    <br />
                    8.3. Ничто в Соглашении не может пониматься как установление
                    между Пользователем и Компанией агентских отношений,
                    отношений товарищества, отношений по совместной
                    деятельности, отношений личного найма, либо каких-то иных
                    отношений, прямо не предусмотренных Соглашением. <br />8.4.
                    Если по тем или иным причинам одно или несколько положений
                    настоящего Соглашения будут признаны недействительными или
                    не имеющими юридической силы, это не оказывает влияния на
                    действительность или применимость остальных положений
                    Соглашения.<br />
                    8.5. Бездействие со стороны Компании в случае нарушения
                    Пользователем либо иными пользователями положений Соглашения
                    не лишает Компанию права предпринять соответствующие
                    действия в защиту своих интересов позднее, а также не
                    означает отказа Компании от своих прав в случае совершения в
                    последующем подобных либо сходных нарушений.<br />
                    9. Контактная информация<br />
                    9.1. Обращения по всем вопросам принимаются по адресу:
                    info@simpra.kz
                  </p>
                </div>
              </div>
            </div>
          </div>
        </div>
        <div class="socials">
          <div>
            <a href="https://www.instagram.com/simprame/" target="_blank">
              <img src="@/assets/images/instagram.png" alt=""
            /></a>

            <img src="@/assets/images/twitter.png" alt="" />
            <img src="@/assets/images/linkedin.png" alt="" />
          </div>
        </div>
      </div>
    </div>
    <div class="mini__footer">
      <h4>Simpra © 2024 Все права защищены.</h4>
    </div>
  </div>
</template>

<style scoped lang="scss">
.footers {
  color: #fff;
  margin-top: 100px;
  .footer {
    background-color: #232323;
    padding: 80px 0;
    .footer__inner {
      display: flex;
      justify-content: center;
      gap: 100px;
      align-items: center;
      @media (max-width: 610px) {
        flex-direction: column;
        gap: 50px;
      }
      .contacts_n_agreement {
        display: flex;
        gap: 100px;
      }
      .contacts {
        display: flex;
        flex-direction: column;
        gap: 30px;

        .main-text {
          h3 {
            font-size: 20px;
          }
        }
        .infos {
          display: flex;
          flex-direction: column;
          gap: 10px;
          h5 {
            font-size: 15px;
            color: #777777;
            margin-bottom: 5px;
          }
          p {
            font-size: 15px;
          }
        }
      }
      .agreement {
        display: flex;
        flex-direction: column;
        gap: 30px;
        .main-text {
          h3 {
            font-size: 20px;
          }
        }
        .infos2 {
          display: flex;
          flex-direction: column;
          gap: 10px;
          h5 {
            color: #777777;
            transition: 0.2s linear;
            cursor: pointer;
          }
          h5:hover {
            color: #fff;
          }
        }
      }

      .socials {
        div {
          display: flex;
          gap: 20px;
          img {
            width: 30px;
          }
        }
      }
      @media (max-width: 610px) {
        .contacts_n_agreement {
          display: flex;
          flex-wrap: wrap;
          justify-content: center;
          text-align: center;
        }
        .contacts {
          display: flex;
          flex-direction: column;
          gap: 30px;

          .main-text {
            h3 {
              font-size: 15px;
            }
          }
          .infos {
            display: flex;
            flex-direction: column;
            gap: 10px;
            h5 {
              font-size: 15px;
              color: #777777;
            }
            p {
              font-size: 15px;
            }
          }
        }
        .agreement {
          display: flex;
          flex-direction: column;
          gap: 30px;
          .main-text {
            h3 {
              font-size: 15px;
            }
          }
          .infos2 {
            display: flex;
            flex-direction: column;
            gap: 10px;
            h5 {
              color: #777777;
              transition: 0.2s linear;
              cursor: pointer;
            }
            h5:hover {
              color: #fff;
            }
          }
        }

        .socials {
          div {
            display: flex;
            gap: 20px;
            img {
              width: 30px;
            }
          }
        }
      }
    }
  }
  .mini__footer {
    background-color: #000;
    text-align: center;
    padding: 20px 0;
    h4 {
      font-size: 15px;
      font-weight: 400;
      color: #b9b9b9;
    }
  }
}
h1 {
  cursor: pointer;
  font-size: 20px;
  color: #fff;
  width: 30px;
  border-radius: 20px;
  padding: 5px;
  text-align: center;
  background-color: #000;
  transition: 0.2s linear;
  position: fixed;
  top: 23;
  right: 423;
  z-index: 30;
}
h1:hover {
  background-color: rgb(113, 0, 0);
}
.modal {
  position: fixed;
  top: 50%;
  left: 50%;
  transform: translate(-50%, -50%);
  background-color: white;
  width: 700px;
  max-width: 90%;
  max-height: 80vh;
  padding: 50px;
  border-radius: 12px;
  box-shadow: 0 4px 10px rgba(0, 0, 0, 0.3);
  z-index: 20;
  display: flex;
  flex-direction: column;
  overflow-y: scroll;
  color: #000;
  animation: slideDown 0.3s ease-out;
}

@keyframes slideDown {
  from {
    opacity: 0;
    transform: translate(-50%, -60%);
  }
  to {
    opacity: 1;
    transform: translate(-50%, -50%);
  }
}

.overlay {
  position: fixed;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background-color: rgba(0, 0, 0, 0.8);
  z-index: 10000;
}
</style>
